In [1]:
### pip intall pandas

# pandas day-11

## how to intall library
- pip install pandas
- pip install numpy

In [39]:
import pandas as pd
import numpy as np

In [40]:
# object creation
s=pd.Series([1,2,np.nan,3,4,5])
s

0    1.0
1    2.0
2    NaN
3    3.0
4    4.0
5    5.0
dtype: float64

In [41]:
import pandas as pd
dates=pd.date_range ("20230701",periods=5)
dates

DatetimeIndex(['2023-07-01', '2023-07-02', '2023-07-03', '2023-07-04',
               '2023-07-05'],
              dtype='datetime64[ns]', freq='D')

In [42]:
dates=pd.date_range("20230701",periods=5)
dates
df=pd.DataFrame(np.random.randn(5,4),index=dates,columns=list("abcd"))
df

                   a         b         c         d
2023-07-01 -0.983823  0.535279  0.490784  0.937381
2023-07-02  0.304854  0.110537 -0.574821 -1.664748
2023-07-03  1.531316  0.090274 -0.218483  0.209938
2023-07-04  1.157644  0.558878 -2.212304  0.623170
2023-07-05 -0.085973 -0.834236  0.585586 -1.030930

In [43]:

import numpy as np
import pandas as pd

df2=pd.DataFrame(
   {
      "id":np.array([1,2,3,4],dtype="int32"), 
       "geneder":pd.Categorical(["male","female","male","female"]),
       "address":"skp",
       "salary":np.array([2,4,5,6],dtype="int32"),
    }
 )
df2

   id geneder address  salary
0   1    male     skp       2
1   2  female     skp       4
2   3    male     skp       5
3   4  female     skp       6

In [44]:
 df2.head(2)

   id geneder address  salary
0   1    male     skp       2
1   2  female     skp       4

In [45]:
df2.tail(3)

   id geneder address  salary
1   2  female     skp       4
2   3    male     skp       5
3   4  female     skp       6

In [46]:
df.dtypes

a    float64
b    float64
c    float64
d    float64
dtype: object

In [47]:
df2.to_numpy()

array([[1, 'male', 'skp', 2],
       [2, 'female', 'skp', 4],
       [3, 'male', 'skp', 5],
       [4, 'female', 'skp', 6]], dtype=object)

In [48]:
df.describe()

              a         b         c         d
count  5.000000  5.000000  5.000000  5.000000
mean   0.384804  0.092147 -0.385848 -0.185038
std    1.001616  0.564077  1.130468  1.115135
min   -0.983823 -0.834236 -2.212304 -1.664748
25%   -0.085973  0.090274 -0.574821 -1.030930
50%    0.304854  0.110537 -0.218483  0.209938
75%    1.157644  0.535279  0.490784  0.623170
max    1.531316  0.558878  0.585586  0.937381

### shifting data rows to column/columns to rows

In [49]:
df2.T

            0       1     2       3
id          1       2     3       4
geneder  male  female  male  female
address   skp     skp   skp     skp
salary      2       4     5       6

### ascending/descding

In [50]:
df2.sort_index(axis=1,ascending=False)

   salary  id geneder address
0       2   1    male     skp
1       4   2  female     skp
2       5   3    male     skp
3       6   4  female     skp

In [51]:
df2.sort_index(axis=1,ascending=True)

  address geneder  id  salary
0     skp    male   1       2
1     skp  female   2       4
2     skp    male   3       5
3     skp  female   4       6

### for single column descnding

In [52]:
df2.sort_values(by="salary",ascending=True)

   id geneder address  salary
0   1    male     skp       2
1   2  female     skp       4
2   3    male     skp       5
3   4  female     skp       6

In [53]:
df2.sort_values(by="salary")

   id geneder address  salary
0   1    male     skp       2
1   2  female     skp       4
2   3    male     skp       5
3   4  female     skp       6

In [54]:
df2["id"]

0    1
1    2
2    3
3    4
Name: id, dtype: int32

In [55]:
df2["salary"]

0    2
1    4
2    5
3    6
Name: salary, dtype: int32

#### display data base on index
- row wise selection

In [56]:
df2[0:3]

   id geneder address  salary
0   1    male     skp       2
1   2  female     skp       4
2   3    male     skp       5

In [57]:
df2.loc[1:2,["geneder","salary","id"]]

  geneder  salary  id
1  female       4   2
2    male       5   3

In [58]:
df2.loc[0,["geneder","salary","id"]]

geneder    male
salary        2
id            1
Name: 0, dtype: object

In [59]:
df.loc["20230701",["a","b"]]

a   -0.983823
b    0.535279
Name: 2023-07-01 00:00:00, dtype: float64

In [60]:
df.loc["20230701":"20230703",["a","b","c","d"]]

                   a         b         c         d
2023-07-01 -0.983823  0.535279  0.490784  0.937381
2023-07-02  0.304854  0.110537 -0.574821 -1.664748
2023-07-03  1.531316  0.090274 -0.218483  0.209938

### fetching data base on index

In [61]:
df.at[dates[1],"a"]

0.30485402918714744

In [62]:
df.iloc[3]

a    1.157644
b    0.558878
c   -2.212304
d    0.623170
Name: 2023-07-04 00:00:00, dtype: float64

In [63]:
df.iloc[3:10]

                   a         b         c        d
2023-07-04  1.157644  0.558878 -2.212304  0.62317
2023-07-05 -0.085973 -0.834236  0.585586 -1.03093

### first three rows ans two columns

In [64]:
df.iloc[0:3,0:2]

                   a         b
2023-07-01 -0.983823  0.535279
2023-07-02  0.304854  0.110537
2023-07-03  1.531316  0.090274

In [65]:
df.iloc[0:3,:]

                   a         b         c         d
2023-07-01 -0.983823  0.535279  0.490784  0.937381
2023-07-02  0.304854  0.110537 -0.574821 -1.664748
2023-07-03  1.531316  0.090274 -0.218483  0.209938

In [66]:

df.iloc[:,0:2]

                   a         b
2023-07-01 -0.983823  0.535279
2023-07-02  0.304854  0.110537
2023-07-03  1.531316  0.090274
2023-07-04  1.157644  0.558878
2023-07-05 -0.085973 -0.834236

#### bolian operators

In [67]:
df[df["a"]>0.3]

                   a         b         c         d
2023-07-02  0.304854  0.110537 -0.574821 -1.664748
2023-07-03  1.531316  0.090274 -0.218483  0.209938
2023-07-04  1.157644  0.558878 -2.212304  0.623170

In [68]:
df[df["a"]<0.3]

                   a         b         c         d
2023-07-01 -0.983823  0.535279  0.490784  0.937381
2023-07-05 -0.085973 -0.834236  0.585586 -1.030930

### adding new column in df

In [69]:
df["E"]=["one","two","one","two","one"]
df

                   a         b         c         d    E
2023-07-01 -0.983823  0.535279  0.490784  0.937381  one
2023-07-02  0.304854  0.110537 -0.574821 -1.664748  two
2023-07-03  1.531316  0.090274 -0.218483  0.209938  one
2023-07-04  1.157644  0.558878 -2.212304  0.623170  two
2023-07-05 -0.085973 -0.834236  0.585586 -1.030930  one

In [70]:
avr=df[["a","b","c","d"]].mean()
avr

a    0.384804
b    0.092147
c   -0.385848
d   -0.185038
dtype: float64

In [71]:
avr=df[["a","b","c","d"]].mean()
avr

a    0.384804
b    0.092147
c   -0.385848
d   -0.185038
dtype: float64

In [72]:
df

                   a         b         c         d    E
2023-07-01 -0.983823  0.535279  0.490784  0.937381  one
2023-07-02  0.304854  0.110537 -0.574821 -1.664748  two
2023-07-03  1.531316  0.090274 -0.218483  0.209938  one
2023-07-04  1.157644  0.558878 -2.212304  0.623170  two
2023-07-05 -0.085973 -0.834236  0.585586 -1.030930  one

### taking the average and then show in new column

In [73]:
df.insert(5,'avrg',[-0.059903,-0.525398,-0.215504,0.808384,00.22],True)
df

                   a         b         c         d    E      avrg
2023-07-01 -0.983823  0.535279  0.490784  0.937381  one -0.059903
2023-07-02  0.304854  0.110537 -0.574821 -1.664748  two -0.525398
2023-07-03  1.531316  0.090274 -0.218483  0.209938  one -0.215504
2023-07-04  1.157644  0.558878 -2.212304  0.623170  two  0.808384
2023-07-05 -0.085973 -0.834236  0.585586 -1.030930  one  0.220000

df["mean"]=["-0.028243","0.434200","-0.280003","-0.065268","-0.028243","0.434200","-0.280003","-0.065268","-0.028243","0.434200","-0.280003","-0.065268","-0.028243","0.434200","-0.280003"]